/**
 * 楼宇列表
 */
export default {
  // /vb/building/buildings?parcelId=B107-0023(1)
  'GET /vb/building/buildings': {
    success: true,
    code: 200,
    msg: '请求成功',
    data: [
      {
        id: 167567,
        basicId: '4403040040100400006',
        type: 'building',
        name: '深铁置业大厦',
        location:
          '{"type":"Polygon","coordinates":[[[114.02284838226119,22.538585178741048],[114.02285170531418,22.538569513312286],[114.02291923679827,22.53858181117872],[114.02295072965666,22.538587562638355],[114.02302684272404,22.53819923384696],[114.02292503687477,22.538183804669096],[114.02252727651522,22.53811135431405],[114.02251782266681,22.53811741500584],[114.02227788644036,22.53807079848837],[114.0222008958056,22.538461247381555],[114.02243619310761,22.53850410441812],[114.02243369861299,22.53851595439791],[114.02244524004873,22.538524462092084],[114.02256055644783,22.538544636936738],[114.02256581336687,22.538518753395838],[114.02259920379215,22.538524587737477],[114.02263539692727,22.53853090660803],[114.02272936105653,22.538547359312368],[114.02272466289328,22.538571751867977],[114.02283963781365,22.5385898387426],[114.02284838226119,22.538585178741048]]]}',
        attributes: {
          jdCode: '440304005',
          jdName: '沙头街道',
          quCode: '440304',
          quName: '福田区',
          bldaddr: '深南大道深铁置业大厦',
          bldgLdArea: 3075.4,
          bldgNo: '4403040040100400006',
          bldgUsage: null,
          floorArea: 147615.62,
          nowname: '深铁置业大厦',
          remark: '图形：地形图,编码来源：网格办',
          sqCode: '440304005040',
          sqName: '天安社区',
          upBldgFloor: '55',
          basicBldgId: 'WGB_4403040040100400006',
          bldcond: '2',
          bldcondName: '在建',
          bldgHeight: 249.0,
          bldstru: '2',
          bldstruName: '框架剪力墙结构',
          bldyear: null,
          bldgUsestate: '综合',
          beregion: '汇通大厦',
          registerNo: null,
          registerType: null,
          estateType: null,
          estateArea: null,
          estateStartdate: null,
          estateEnddate: null,
          registerDate: null,
          key: 1,
          value: '永久建筑',
        },
      },
    ],
  },
};
